{
  "latest_version": "1.4.1",
  "release_notes": {
    "Arabic": "بعض التحسينات الصغيرة.\nالإصدار 1.4.0:\nتم إضافة نظام التحديثات التجريبية. يمكنك تفعيل خيار الحصول على التحديثات التجريبية من الإعدادات, ويجب ملاحظة أن التحديثات التجريبية قد تحتوي على أخطاء كبيرة, عطل الخيار وأعد تثبيت أحدث نسخة مستقرة متاحة في أي وقت.\nتم إضافة خيار لتحديد عدد الملفات التي سيتم تحويلها في نفس الوقت.\nلن يكتب Sound Transcriber سجل الأحداث بشكل افتراضي بعد الآن. قم بتفعيله من الإعدادات عند ما تواجه أخطاء ثم كرر الخطوات, افتراضيًا, سيحتفظ السجل بتفاصيل آخر خطوة, وسيتم حذف تفاصيل العمليات السابقة في حال قمت بتعطيله.\nيعرض السجل الآن المزيد من المعلومات.\nتم تحسين وظيفة زر النسخ. نتيجة لذلك، يجب أن يظل زر النسخ متاحًا طالما أن مربع النتيجة يحتوي على نصوص تم تحويلها.\nتمت إضافة خيار للتبرع للمطورين.\nتم إجراء محاولة لتقليل رسائل الأخطاء التي ترجعها خدمة Google.\nتم إصلاح بعض الأخطاء, خصوصأ الأخطاء المتعلقة بإيقاف واستئناف عملية التحويل.\nتم تحديث دليل المستخدم ليشمل تفاصيل الترجمة والتحديثات التجريبية وغيرها من المعلومات المهمة. نوصي بشدة بمراجعته للحصول على أحدث المعلومات.\nتم تحديث إصدار Python المستخدم إلى Python3.12.\nبعض التحسينات الصغيرة.",
    "English": "Several minor improvements.\nVersion 1.4.0:\nAdded  Beta updates system. You can enable this option in settings to receive beta updates. Please note that beta updates may contain significant bugs. You can disable the option and revert to the latest stable version at any time.\nAdded an option to specify the number of files to be converted simultaneously.\nSound Transcriber will no longer generate an event log by default. You can enable it from the settings when encountering errors and then repeat the steps. By default, the log will retain the details of the last step, and previous operations details will be deleted when disabled.\nThe logs now display more information.\nThe functionality of the copy button has been enhanced. As a result, the copy button should remain available as long as the result field contains transcribed texts.\nAdded a donation option for developers.\nAttempted to minimize errors returned by the Google service.\nFixed several bugs, particularly those related to pausing and resuming the transcription process.\nUpdated the user guide to include translation details, beta updates, and other important information. We highly recommend reviewing it for the latest info.\nUpdated the Python version used to Python 3.12.\nSeveral minor improvements.",
    "Spanish": "Varios cambios menores.## Versión 1.4.0:\nAñadido sistema de actualizaciones Beta. Se puede añadir desde los ajustes para recibir actualizaciones en fase Beta. Tenga en cuenta que estas actualizaciones pueden tener errores importantes. Podrá desactivar esta función y volver a la última versión estable en cualquier momento.\nAñadida una opción para especificar el número de ficheros a convertir simultáneamente\nSound Transcriber no seguirá generando un archivo de registro (log) de manera automática. Se podrá activar la opción desde los ajustes cuando se encuentren errores y en ese momento repetir los pasos que provocaron el error. Por defecto, el log conservará los detalles del último paso, y los detalles de las operaciones anteriores serán eliminados cuando la opción se desactive.\nLos archivos de registro (logs) ahora muestran más información.\nLa funcionalidad del botón de copiar ha sido mejorada. El botón de copiar estará habilitado mientras el campo de resultado tenga texto transcrito.\nAñadida una opción de donaciones para los desarrolladores\nSe ha intentado minimizar los errores devueltos por el servicio de Google.\nCorregidos varios errores, en particular algunos relacionados con pausar y reanudar el proceso de transcripción.\nActualizada la guía de usuario para que ahora incluya detalles de traducción, actualizaciones Beta y otra información importante. Recomendamos su consulta para conocer las últimas novedades.\nActualizada la versión de Python usada a Python 3.12.\nPequeñas mejoras.",
    "French": "Diverses améliorations mineures.\nVersion 1.4.0:\nAjout d'un système de mises à jour bêta. Vous pouvez activer cette option dans les paramètres pour recevoir les mises à jour bêta. Veuillez noter que les mises à jour bêta peuvent contenir des bogues importants. Vous pouvez désactiver cette option et revenir à la dernière version stable à tout moment.\nAjout d'une option permettant de spécifier le nombre de fichiers à convertir simultanément.\nSound Transcriber ne génère plus de journal d'événements par défaut. Vous pouvez l'activer dans les paramètres lorsque vous rencontrez des erreurs, puis répéter les étapes. Par défaut, le journal conservera les détails de la dernière étape, et les détails des opérations précédentes seront supprimés si désactivé.\nLes journaux affichent désormais davantage d'informations.\nLa fonctionnalité du bouton de copie a été améliorée. En conséquence, le bouton de copie devrait rester disponible tant que le champ de résultat contient des textes transcrits.\nAjout d'une option de donation pour les développeurs.\nTentative de minimiser les erreurs renvoyées par le service Google.\nCorrection de plusieurs bogues, en particulier ceux liés à la mise en pause et à la reprise du processus de transcription.\nMise à jour du guide de l'utilisateur pour inclure les détails de la traduction, les mises à jour de la version bêta et d'autres informations importantes. Nous vous recommandons vivement de le consulter pour obtenir les dernières informations.\nMise à jour de la version de Python utilisée à Python 3.12.\nPlusieurs améliorations mineures.",
    "Russian": "Несколько незначительных улучшений.\nВерсия 1.4.0:\nДобавлена система бета-обновлений. Вы можете включить эту опцию в настройках, чтобы получать бета-обновления. Обратите внимание, что бета-версии могут содержать значительные ошибки. Вы можете отключить эту опцию и вернуться к последней стабильной версии в любое время.\nДобавлена возможность указать количество одновременно конвертируемых файлов.\nSound Transcriber больше не будет генерировать журнал событий по умолчанию. Вы можете включить его в настройках при возникновении ошибок, а затем повторить все действия. По умолчанию в журнале сохраняются сведения о последнем шаге, а при отключении удаляются сведения о предыдущих операциях.\nВ журналах теперь отображается больше информации.\nУлучшена функциональность кнопки копирования. В результате кнопка копирования должна оставаться доступной до тех пор, пока поле результатов содержит расшифрованный текст.\nДобавлена возможность пожертвования разработчикам.\nСделана попытка свести к минимуму ошибки, возвращаемые сервисом Google.\nИсправлено несколько ошибок, в частности, связанных с приостановкой и возобновлением расшифровки.\nОбновлено руководство пользователя, в которое включены подробности перевода, обновления бета-версии и другая важная информация. Мы настоятельно рекомендуем ознакомиться с ним, чтобы получить самую свежую информацию.\nОбновлена используемая версия Python до Python 3.12.\nНесколько незначительных улучшений."
  },
  "download_url": "https://github.com/tecwindow/SoundTranscriber/releases/download/1.4.1/SoundTranscriberSetupV1.4.1.exe",
  "supported_versions": {
    "1.0.0": false,
    "1.1.0": false,
    "1.1.1": false,
    "1.1.2": false,
    "1.2.0": false,
    "1.3.0": false,
    "1.3.1": false,
    "1.3.2": false,
    "1.3.3": false,
    "1.4.0": false,
    "1.4.1": true
    }
}
