{
  "latest_version": "1.1.2",
  "release_notes": {
    "Arabic": "هام, بدءاً من هذا الإصدار, سيدعم Sound Transcriber إصدارات Windows 64 bit فقط.\nتمت إضافة الترجمة الإسبانية. جزيل الشكر لـ Georgiana Frincu.\nأصبح بإمكانك تحويل فيديوهات من Youtube وـ Facebook وـ Twitter (X) وغيرها من الخدمات إلى نص، بحيث سيقوم Sound Transcriber بتحميل الفيديو ثم تحويله.\nيمكنك اختيار الاحتفاظ بالملف الأصل بعد التحويل أو حذفه من الإعدادات.\nتمت إضافة ميزة الإيقاف المؤقت والاستئناف لعملية التحويل.\nأصبح بإمكانك لصق مسارات ملفات ليتم تحويلها.\nيمكنك تحديد امتداد الملف الذي يتم إرساله إلى wit.ai للتحويل من الإعدادات.\nسيحاول Sound Transcriber التعامل مع الملفات التي تحتوي أسماؤها على رموز Emoji.\nلم يعد Sound Transcriber يتوقف أثناء التحويل؛ وفي حال حدث ذلك, ستبقى قادرا على متابعة العملية.\nتحسينات صغيرة هنا وهناك.\nملاحظات:\nيمكنك إيقاف العملية مؤقتا أثناء استخراج النص, لكن لا يمكن إيقافها مؤقتا أثناء تقسيم الملف.\nفي حال قمت بإيقاف عمليةٍ ما مؤقتا ثم بدأت عملية تحويل جديدة, ستفقد كل ما يخص العملية السابقة؛ لذا, يُنصَح بحفظ النتيجة الحالية قبل بدء عملية تحويل جديدة.\nيؤدي اختيار صيغة wav في إعدادات wit.ai إلى تقسيم الملف بشكل أسرع بكثير, إلا أن تحويله سيكون أبطأ ويستهلك المزيد من بيانات الإنترنت. نوصي بتجربة صيغة ogg وإخبارنا بالنتائج.",
    "English": "Important, starting with this version, Sound Transcriber will only support 64 bit versions of Windows.\nAdded Spanish translation. Many thanks to Georgiana Frincu.\nYou can now convert videos from Youtube, Facebook, Twitter (X) and other services into text, so that Sound Transcriber will download the video and then convert it.\nYou can choose to keep the original file after conversion or delete it from the settings.\nPause and resume feature has been added to the transcription process.\nYou can now paste file paths to be converted.\nYou can specify the file extension that is sent to wit.ai for conversion from settings.\nSound Transcriber will try to handle files with names contain Emojis.\nSound Transcriber no longer stops during conversion. If this happens, you will still be able to continue the process.\nSmall improvements here and there.\nNotes:\nPausing is supported while extracting text but not while splitting files.\nIf you temporarily stop a process and then start a new conversion process, you will lose everything related to the previous process; Therefore, it is advisable to save the current result before starting a new conversion.\nChoosing the wav format in wit.ai settings speeds up file splitting but leads to slower conversion and increased data usage. Consider trying .ogg and sharing your feedback on the results."
  },
  "download_url": "https://github.com/tecwindow/SoundTranscriber/releases/download/V1.2.0/SoundTranscriberV1.2.0.exe",
  "supported_versions": {
    "1.0.0": false,
    "1.1.0": false,
    "1.1.1": false,
    "1.1.2": true,
    "1.2.0": true
  }
}