{
  "latest_version": "1.2.0",
  "release_notes": {
    "Arabic": "تمت إضافة الترجمة الفرنسية, جزيل الشكر لرياض أسوم.\nأصبح بإمكانك فتح ملفات في Sound Transcriber لتحويلها من قائمة السياق لأنواع الملفات المدعومة.\nأصبح بإمكانك فتح Sound Transcriber من نافذة التشغيل Run عن طريق كتابة الكلمة st.\nأصبح Sound Transcriber قادرا على التعرف على ترجمات الواجهة وملفات المساعدة الجديدة بشكل تلقائي. قم بترجمة ملف messages.pot باستخدام Poedit ثم احفظ الملفات بنفس ترتيب ملفات اللغات المدعومة حاليا.\nفي حال تعطيل خيار الاحتفاظ بالملفات التي تم تنزيلها, سيحتفظ Sound Transcriber بالملفات التي تم تنزيلها حتى يتم إغلاق البرنامج, وهو أمر مفيد في حال أردت تكرار عملية التحويل بخيارات مختلفة.\nتم إصلاح أخطاء عديدة مرتبطة بميزة اللصق من الحافظة, بما في ذلك تجاهل بعض المسارات وفشل بدء التحويل من رسالة الاكتشاف ولصق روابط في أي وقت وغير ذلك. جزيل الشكر لـ أ. دولت حسن على الملاحظة التي كانت سبباً لاكتشاف الكثير من الأخطاء المرتبطة بهذه الميزة.\nتم إصلاح خطأ كان يتسبب في بدء Sound Transcriber بلغة مختلفة عن اللغة الحالية بعد التحديث أحيانا.\nلم يعد بإمكانك فتح نافذتين من Sound Transcriber في الوقت نفسه.\nأُجريَت بعض التعديلات على طريقة إيقاف التحويل.\nبعض التحسينات الصغيرة.",
    "English": "French translation added. Many thanks to Riad Assoum.\nYou can now open files in Sound Transcriber to Transcribe them from the context menu of supported file types.\nYou can now access Sound Transcriber swiftly by simply typing st in the Run dialog.\nSound Transcriber is now able to automatically recognize interface translations and integrate new help files. To contribute, translate the messages.pot file using Poedit and save the files in the same order as the existing language files.\nWhen the option to keep downloaded files is turned off, Sound Transcriber will retain them until the program is closed. This is particularly handy if you wish to repeat the conversion process with different options.\nSeveral bugs related to the paste from clipboard feature have been fixed. Like ignoring certain paths, failure to start conversions from the detection message, pasting links at any time, and more. Many thanks to Dawlat Hassan for the note that helped uncover many of these bugs associated with this feature.\nFixed a bug that occasionally caused Sound Transcriber to start in a different language after the last update.\nYou can no longer open two instances of Sound Transcriber simultaneously.\nImplemented changes to the conversion stopping method.\nVarious minor improvements.",
    "Spanish": "Añadida traducción al francés. Muchas gracias a Riad Assoum.\nAhora se pueden abrir archivos en Sound Transcriber para transcribirlos desde el menú contextual de los tipos de archivo compatibles.\nAhora se puede acceder rápidamente a Sound Transcriber con sólo escribir st en el cuadro de diálogo de Ejecutar.\nSound Transcriber es ahora capaz de reconocer automáticamente las traducciones de la interfaz e integrar nuevos archivos de ayuda. Para contribuir, traduzca el archivo messages.pot utilizando Poedit y guarde los archivos en el mismo orden que los archivos de idioma existentes.\nSi se desactiva la opción de conservar los archivos descargados, Sound Transcriber los conservará hasta que se cierre el programa. Esto resulta especialmente práctico si desea repetir el proceso de conversión con diferentes opciones.\nSe han corregido varios errores relacionados con la función de pegar desde el portapapeles. Como ignorar ciertas rutas, fallos al iniciar las conversiones desde el mensaje de detección, pegar enlaces en cualquier momento, y más. Muchas gracias a Dawlat Hassan por el comentario que ayudó a descubrir muchos de estos errores relacionados con esta función.\nArreglado un error que a veces provocaba que Sound Transcriber se iniciara en otro idioma después de la última actualización.\nYa no se pueden abrir dos instancias de Sound Transcriber simultáneamente.\nSe han introducido cambios en el método de detención de la conversión.\nOtros cambios menores.",
    "French": "Ajout de la traduction française. Un grand merci à Riad Assoum.\nVous pouvez maintenant ouvrir des fichiers dans Sound Transcriber pour les transcrire à partir du menu contextuel des types de fichiers pris en charge.\nVous pouvez désormais accéder rapidement à Sound Transcriber en tapant simplement st dans la boîte de dialogue Exécuter.\nSound Transcriber est désormais capable de reconnaître automatiquement les traductions de l'interface et d'intégrer de nouveaux fichiers d'aide. Pour y contribuer, traduisez le fichier messages.pot à l'aide de Poedit et enregistrez les fichiers dans le même ordre que les fichiers de langue existants.\nLorsque l'option de conservation des fichiers téléchargés est désactivée, Sound Transcriber les conserve jusqu'à la fermeture du programme. Ceci est particulièrement pratique si vous souhaitez répéter le processus de conversion avec différentes options.\nMerci à Dawlat Hassan pour l'information - de nombreux bogues liés à la fonction de collage dans le presse-papiers ont été éliminés. Des problèmes tels que l'ignorance de certains chemins, l'impossibilité de lancer la conversion à partir du message de détection, le collage de liens à n'importe quel moment, et bien d'autres encore, appartiennent désormais au passé.\nCorrection d'un bogue qui provoquait parfois le démarrage de Sound Transcriber dans une langue différente après la dernière mise à jour.\nVous ne pouvez plus ouvrir deux instances de Sound Transcriber simultanément.\nDes changements ont été apportés à la méthode d'arrêt de la conversion pour une expérience plus fluide.\nDiverses améliorations mineures ont été apportées pour une meilleure expérience utilisateur."
  },
  "download_url": "https://github.com/tecwindow/SoundTranscriber/releases/download/V1.2.0/SoundTranscriberV1.2.0.exe",
  "supported_versions": {
    "1.0.0": false,
    "1.1.0": false,
    "1.1.1": false,
    "1.1.2": true,
    "1.2.0": true,
    "1.3.0": true
  }
}